## Production: eks
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 15 to add, 2 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                 NAME                                  |
|--------|-----------------------------------------------------------------------|
| add    | `aws_cloudwatch_log_group.notification-canada-ca-eks-prometheus-logs` |
|        | `aws_cloudwatch_log_metric_filter.admin-evicted-pods`                 |
|        | `aws_cloudwatch_log_metric_filter.api-evicted-pods`                   |
|        | `aws_cloudwatch_log_metric_filter.celery-evicted-pods`                |
|        | `aws_cloudwatch_log_metric_filter.document-download-evicted-pods`     |
|        | `aws_cloudwatch_log_metric_filter.documentation-evicted-pods`         |
|        | `aws_cloudwatch_metric_alarm.admin-evicted-pods`                      |
|        | `aws_cloudwatch_metric_alarm.api-evicted-pods`                        |
|        | `aws_cloudwatch_metric_alarm.celery-evicted-pods`                     |
|        | `aws_cloudwatch_metric_alarm.document-download-evicted-pods`          |
|        | `aws_cloudwatch_metric_alarm.documentation-evicted-pods`              |
|        | `aws_route53_record.api-k8s-scratch-notification-CNAME`               |
|        | `aws_route53_record.api-weighted-0-scratch-notification-A`            |
|        | `aws_route53_record.notificatio-root-WC`                              |
|        | `aws_route53_record.notification-root`                                |
| update | `aws_cloudwatch_query_definition.bounce-rate-critical`                |
|        | `aws_cloudwatch_query_definition.bounce-rate-warning`                 |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.notification-canada-ca-eks-prometheus-logs will be created
  + resource "aws_cloudwatch_log_group" "notification-canada-ca-eks-prometheus-logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/containerinsights/notification-canada-ca-production-eks-cluster/prometheus"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags_all          = (known after apply)
    }

  # aws_cloudwatch_log_metric_filter.admin-evicted-pods will be created
  + resource "aws_cloudwatch_log_metric_filter" "admin-evicted-pods" {
      + id             = (known after apply)
      + log_group_name = "/aws/containerinsights/notification-canada-ca-production-eks-cluster/prometheus"
      + name           = "admin-evicted-pods"
      + pattern        = "{ ($.reason = \"Evicted\") && ($.kube_pod_status_reason = 1) && ($.pod = \"admin-*\") }"

      + metric_transformation {
          + name      = "admin-evicted-pods"
          + namespace = "LogMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_cloudwatch_log_metric_filter.api-evicted-pods will be created
  + resource "aws_cloudwatch_log_metric_filter" "api-evicted-pods" {
      + id             = (known after apply)
      + log_group_name = "/aws/containerinsights/notification-canada-ca-production-eks-cluster/prometheus"
      + name           = "api-evicted-pods"
      + pattern        = "{ ($.reason = \"Evicted\") && ($.kube_pod_status_reason = 1) && ($.pod = \"api-*\") }"

      + metric_transformation {
          + name      = "api-evicted-pods"
          + namespace = "LogMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_cloudwatch_log_metric_filter.celery-evicted-pods will be created
  + resource "aws_cloudwatch_log_metric_filter" "celery-evicted-pods" {
      + id             = (known after apply)
      + log_group_name = "/aws/containerinsights/notification-canada-ca-production-eks-cluster/prometheus"
      + name           = "celery-evicted-pods"
      + pattern        = "{ ($.reason = \"Evicted\") && ($.kube_pod_status_reason = 1) && ($.pod = \"celery-*\") }"

      + metric_transformation {
          + name      = "celery-evicted-pods"
          + namespace = "LogMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_cloudwatch_log_metric_filter.document-download-evicted-pods will be created
  + resource "aws_cloudwatch_log_metric_filter" "document-download-evicted-pods" {
      + id             = (known after apply)
      + log_group_name = "/aws/containerinsights/notification-canada-ca-production-eks-cluster/prometheus"
      + name           = "document-download-evicted-pods"
      + pattern        = "{ ($.reason = \"Evicted\") && ($.kube_pod_status_reason = 1) && ($.pod = \"document-download-*\") }"

      + metric_transformation {
          + name      = "document-download-evicted-pods"
          + namespace = "LogMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_cloudwatch_log_metric_filter.documentation-evicted-pods will be created
  + resource "aws_cloudwatch_log_metric_filter" "documentation-evicted-pods" {
      + id             = (known after apply)
      + log_group_name = "/aws/containerinsights/notification-canada-ca-production-eks-cluster/prometheus"
      + name           = "documentation-evicted-pods"
      + pattern        = "{ ($.reason = \"Evicted\") && ($.kube_pod_status_reason = 1) && ($.pod = \"documentation-*\") }"

      + metric_transformation {
          + name      = "documentation-evicted-pods"
          + namespace = "LogMetrics"
          + unit      = "None"
          + value     = "1"
        }
    }

  # aws_cloudwatch_metric_alarm.admin-evicted-pods will be created
  + resource "aws_cloudwatch_metric_alarm" "admin-evicted-pods" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + alarm_description                     = "One or more Kubernetes Admin Pods is reporting as Evicted"
      + alarm_name                            = "evicted-admin-pods-detected"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + insufficient_data_actions             = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + metric_name                           = "admin-evicted-pods"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.api-evicted-pods will be created
  + resource "aws_cloudwatch_metric_alarm" "api-evicted-pods" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + alarm_description                     = "One or more Kubernetes API Pods is reporting as Evicted"
      + alarm_name                            = "evicted-api-pods-detected"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + insufficient_data_actions             = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + metric_name                           = "api-evicted-pods"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.celery-evicted-pods will be created
  + resource "aws_cloudwatch_metric_alarm" "celery-evicted-pods" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + alarm_description                     = "One or more Kubernetes Celery Pods is reporting as Evicted"
      + alarm_name                            = "evicted-celery-pods-detected"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + insufficient_data_actions             = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + metric_name                           = "celery-evicted-pods"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.document-download-evicted-pods will be created
  + resource "aws_cloudwatch_metric_alarm" "document-download-evicted-pods" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + alarm_description                     = "One or more Kubernetes Document Download Pods is reporting as Evicted"
      + alarm_name                            = "evicted-document-download-pods-detected"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + insufficient_data_actions             = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + metric_name                           = "document-download-evicted-pods"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_metric_alarm.documentation-evicted-pods will be created
  + resource "aws_cloudwatch_metric_alarm" "documentation-evicted-pods" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + alarm_description                     = "One or more Kubernetes Documentation Pods is reporting as Evicted"
      + alarm_name                            = "evicted-documentation-pods-detected"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + insufficient_data_actions             = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + metric_name                           = "documentation-evicted-pods"
      + namespace                             = "LogMetrics"
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:296255494825:alert-warning",
        ]
      + period                                = 60
      + statistic                             = "Sum"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "notBreaching"
    }

  # aws_cloudwatch_query_definition.bounce-rate-critical will be updated in-place
  ~ resource "aws_cloudwatch_query_definition" "bounce-rate-critical" {
        id                  = "566d9362-3e20-4962-a135-c4b06c6f6d7a"
        name                = "Critical bounces"
      ~ query_string        = <<-EOT
            fields @timestamp, log, kubernetes.container_name as app, kubernetes.pod_name as pod_name, @logStream
          - | filter kubernetes.container_name like /^celery/
          + | filter kubernetes.container_name like /admin|api/
            | filter @message like "critical bounce rate threshold of 10"
            | sort @timestamp desc
            | limit 20
        EOT
        # (2 unchanged attributes hidden)
    }

  # aws_cloudwatch_query_definition.bounce-rate-warning will be updated in-place
  ~ resource "aws_cloudwatch_query_definition" "bounce-rate-warning" {
        id                  = "83cbdfcd-715d-47f5-8ab9-474fc15a485e"
        name                = "Warning bounces"
      ~ query_string        = <<-EOT
            fields @timestamp, log, kubernetes.container_name as app, kubernetes.pod_name as pod_name, @logStream
          - | filter kubernetes.container_name like /^celery/
          + | filter kubernetes.container_name like /admin|api/
            | filter @message like "warning bounce rate threshold of 5"
            | sort @timestamp desc
            | limit 20
        EOT
        # (2 unchanged attributes hidden)
    }

  # aws_route53_record.api-k8s-scratch-notification-CNAME will be created
  + resource "aws_route53_record" "api-k8s-scratch-notification-CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "api-k8s.notification.canada.ca"
      + records         = [
          + "notification-production-alb-1685085140.ca-central-1.elb.amazonaws.com",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.api-weighted-0-scratch-notification-A will be created
  + resource "aws_route53_record" "api-weighted-0-scratch-notification-A" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "api.notification.canada.ca"
      + set_identifier  = "loadbalancer"
      + type            = "A"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"

      + alias {
          + evaluate_target_health = false
          + name                   = "notification-production-alb-1685085140.ca-central-1.elb.amazonaws.com"
          + zone_id                = "ZQSVJUPU6J1EY"
        }

      + weighted_routing_policy {
          + weight = 0
        }
    }

  # aws_route53_record.notificatio-root-WC will be created
  + resource "aws_route53_record" "notificatio-root-WC" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "*.notification.canada.ca"
      + type            = "A"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"

      + alias {
          + evaluate_target_health = false
          + name                   = "notification-production-alb-1685085140.ca-central-1.elb.amazonaws.com"
          + zone_id                = "ZQSVJUPU6J1EY"
        }
    }

  # aws_route53_record.notification-root will be created
  + resource "aws_route53_record" "notification-root" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "notification.canada.ca"
      + type            = "A"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"

      + alias {
          + evaluate_target_health = true
          + name                   = "notification-production-alb-1685085140.ca-central-1.elb.amazonaws.com"
          + zone_id                = "ZQSVJUPU6J1EY"
        }
    }

Plan: 15 to add, 2 to change, 0 to destroy.

Warning: Argument is deprecated

  with aws_wafv2_web_acl.notification-canada-ca,
  on waf.tf line 1, in resource "aws_wafv2_web_acl" "notification-canada-ca":
   1: resource "aws_wafv2_web_acl" "notification-canada-ca" {

Use rule_action_override instead

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.celery-error"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.scanfiles-timeout"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.notification-canada-ca-alt[0]"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_listener.notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-admin"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-document-api"]
WARN - plan.json - main - Missing Common Tags: ["aws_alb_target_group.notification-canada-ca-documentation"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-application-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-cluster-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.notification-canada-ca-eks-prometheus-logs"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-evicted-pods"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-pods-high-memory-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.admin-replicas-unavailable"]
WARN - plan.json - main - Missing Common Tags:...
```

</details>
